10/data/attachments/11e21ae5b43ffc98.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Robin_edge_Friend_93607_6</nif:username>
            <nif:friendToBeRequested>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>